{
  "welcome": "Welcome",
  "findMeIn": "find me in",
  "fullName": "AmirHossein Amouzgar",
  "role": "Front-end Developer",
  "details": "details",
  "mobilePhone": "+989190052466",
  "header": {
    "homeTab": "_hello",
    "aboutMeTab": "_about-me",
    "projectsTab": "_projects",
    "contactMeTab": "_contact-me"
  },
  "mainPage": {
    "greeting": "Hi all. I am",
    "startGame": "start-game",
    "gameOver": "GAME OVER!",
    "snakeGame": "SNAKE GAME",
    "enjoyTheGame": "You can enjoy the game :)",
    "seeInGithub": "You can also see it in my github page",
    "findMyProfileInGithub": "Find my profile in github",
    "game": {
      "useKeyboard": "use keyboard",
      "arrowsToPlay": "arrows to play",
      "score": "score",
      "highScore": "high-score"
    }
  },
  "aboutMe": {
    "bio": "bio",
    "highSchool": "high-school",
    "university": "university",
    "codeSnippetShowcase": "Code snippet showcase",
    "selectFileSentence": "Please select a file from files section",
    "pageTitle": "_about-me",
    "files": {
      "biography": "biography",
      "biographyText": "I am AmirHossein Amouzgar, a passionate front-end web developer born in 2001.{br} I hold a Bachelor's degree in Industrial Engineering from Qom University of Technology.{br} My journey into programming began at the age of 18 when I discovered a strong interest in web design and development, leading me to self-study HTML, CSS, and JavaScript.{br} Over the years, I have honed my skills in various front-end technologies and frameworks, particularly Vue.js, Nuxt.js, Angular and React. My expertise includes creating responsive, user-friendly interfaces and integrating complex state management systems.{br} I am also familiar with back-end concepts and have some experience working with Node.js and databases such as MongoDB and MySQL.{br} I am proficient in using tools like Bootstrap, Tailwind, SASS, and various version control and task management systems.{br} My ability to work comfortably in English allows me to effectively study documentation and take courses to continuously improve my skills.{br}In addition to my technical abilities, I possess strong teamwork and remote working skills, making me an adaptable and collaborative developer. I am always eager to learn new things and stay updated with the latest industry trends.",
      "contactInformation": "contact-info",
      "contactInformationText": "- Phone Number: +98 919 0052 466 {br} - Telegram ID: amirhosseinamz {br} - Instagram ID: amirhosseinamz",
      "interests": "interests",
      "interestsText": "- Web Development {br} - Learning New Technologies {br} - Team Collaboration {br} - Continuous Learning and Improvement {br} - Team Management {br} - Mentoring {br} - Artificial Intelligence",
      "languages": "languages",
      "languagesText": "- Persian (Native) {br} - English (Fluent)",
      "skills": {
        "skillsTitle": "skills",
        "javascript": "javascript",
        "javascriptContent": "- Proficient in ES6+ syntax and features {br} - Extensive experience with Vue.js and Angular frameworks (and React a bit) {br} - Knowledgeable in asynchronous programming and AJAX",
        "htmlAndCss": "html-css",
        "htmlAndCssContent": "- Proficient in HTML5 and CSS3{br}- Experience with responsive design frameworks such as Bootstrap and Tailwind{br}- Skilled in using SASS for advanced styling",
        "typescript": "typescript",
        "typescriptContent": "- Comfortable using TypeScript in various projects{br}- Experience integrating TypeScript with Vue.js, Angular, and Node.js",
        "frameworks": "frameworks",
        "frameworksContent": "- Vue.js: Proficient in Vue.js and its tools{br}- Nuxt.js: Extensive experience with Nuxt 2 and Nuxt 3{br}- Angular: Experienced with Angular framework and worked on large-scale and online angular project{br}- React: Basic experience with React"
      },
      "experience": {
        "experienceTitle": "experience",
        "parsData": "pars-data",
        "parsDataContent": "Company: ParsData{br}Location: Tehran{br}Role: Front-End Developer (Nuxt){br}Duration: About a year{br}Responsibilities:{br}- Developed responsive UI components using Nuxt.js{br}- Integrated state management tools such as VueX{br}- Refactor the whole project and create base and reusable components",
        "samaneAhan": "samane-ahan",
        "samaneAhanContent": "Company: Samane Ahan{br}Location: Qom{br}Role: Front-End Developer(Nuxt){br}Duration: About a year{br}Responsibilities:{br}- Utilized Tailwind for responsive design{br}- Building a Nuxt project from scratch and collaborating with variant teammates{br}",
        "drKermani": "dr-kermani",
        "drKermaniContent": "Company: DrKermani (Kermani Diet){br}Location: Qom{br}Role: Front-End Developer(Vue){br}Duration: About a year{br}Responsibilities:{br}- Designed UI components with Element UI kit and Vuetify{br}- Ensured cross-browser compatibility and responsive design{br}- Add features and refactor drkermanidiet Vue app {br}- Collaborated with back-end developer to implement RESTful APIs",
        "mahanSoft": "mahan-soft",
        "mahanSoftContent": "Company: Mahan Soft{br}Location: Qom{br}Role: Front-End Developer(Nuxt 3 + Typescript){br}Duration: about a year{br}Responsibilities:{br}- Developed front-end components using Nuxt 3{br}- Integrated TypeScript for improved code maintainability{br}- Cooperation with other team members such as front-end developers, back-end developers, designers, devops, QA testers, etc.",
        "helpsy": "helpsy",
        "helpsyContent": "Company: Helpsy{br}Location: Qom-Isfahan{br}Role: Front-End Developer(Angular){br}Duration: Working from 2023{br}Responsibilities:{br}- Implemented responsive designs using Bootstrap and SCSS{br}- Collaborated with remote team to deliver high-quality projects",
        "otherProjects": "other-projects",
        "otherProjectsContent": "Project Name: WinWin{br}Client: WinWin Company{br}Role: Front-End Developer{br}Technologies Used: HTML, CSS, Tailwind, Vanilla JS{br}Description: Developed and maintained a pixel-perfect and responsive web application for WinWin, ensuring a seamless user experience across different devices. {br} ################################ {br} Project Name: Holding Saadat{br}Client: Saadat-Holding{br}Role: Front-End Developer{br}Technologies Used: HTML, Css, Tailwind, Vanilla Js{br}Description: Created an optimized project designed in Figma with the cooperation of designer and backend developer."
      },
      "education": {
        "educationTitle": "education",
        "degree": "degree",
        "degreeContent": "Degree: Bachelor of Industrial Engineering{br}University: Qom University of Technology{br}Year of Graduation: 2024"
      }
    },
    "createdIn": "Created in",
    "codeSnippet": {
      "dataFetcherDescription": "The DataFetcher class is designed to handle HTTP requests and cache the results. It optimizes data retrieval by storing responses in a cache so that subsequent requests to the same URL do not need to fetch data again from the network. This can be particularly useful for improving performance and reducing network load.",
      "toastDescription": "This code defines a Pinia store to manage toast notifications in a Vue application. Toast notifications are temporary messages that appear on the screen to provide feedback or updates to the user. The store includes functionalities to create, display, and automatically remove these notifications after a specified timeout.",
      "codeDetails": "code-details"
    }
  },
  "projects": {
    "projects": "projects",
    "pageTitle": "_projects",
    "filters": "filters",
    "images": "images",
    "projectDetails": "project-details",
    "helpsyDescription": "Helpsy is a cutting-edge platform designed to facilitate seamless interactions between therapists and patients. This innovative website features two distinct dashboards: one for therapists and one for patients, each equipped with tailored functionalities to enhance their experience. {br}Patient Dashboard{br}- Explore Therapists: Browse through a diverse range of therapists, view their profiles, and read reviews from other patients.Check Availability: View therapists' schedules and available time slots.{br}- Booking and Cancellation: Easily book or cancel appointments with just a few clicks.{br}- Direct Communication: Connect with therapists directly through the platform for any inquiries or support. {br} Therapist Dashboard {br} Comprehensive Statistics: Access detailed analytics and performance metrics.{br}- Patient Interaction: Communicate with patients, review their profiles, and manage appointments.{br}- Schedule Management: Set and adjust your availability, and view upcoming appointments in your calendar.{br}- Session Oversight: Review and manage all scheduled sessions and patient information. {br} Technologies Used: {br} The platform is built using Angular, Pure CSS, and Bootstrap, along with various Angular tools to ensure a responsive, user-friendly experience. {br} Here is some images from therapist dashboard:",
    "drKermaniDescription": "DrKermaniDiet is a dynamic and bustling online platform dedicated to helping individuals achieve their weight management and health goals through tailored dietary plans. This comprehensive system not only provides personalized diet recommendations but also includes a range of specialized sub-pages and landing sections.Key Contributions:{br}Refactoring: Improved the structure and performance of the application for a more efficient user experience.{br}Feature Enhancement: Added new functionalities to enhance the app’s capabilities and user engagement.{br}Landing Page Design: Created various landing pages to optimize user interaction and information accessibility.Technologies Used:{br}The platform utilizes Vue.js, Element UI, Bootstrap, and associated tools to deliver a responsive and intuitive interface.",
    "winwinDescription": "WinWin is an innovative platform designed to streamline the process of discovering, purchasing, and renting properties in Dubai. The site features a wealth of detailed pages and information about various real estate listings, making it easier for users to find their ideal property.{br}{br}Key Features:{br}Comprehensive Property Listings: Browse and explore a wide range of properties available for sale or rent in Dubai.{br}Detailed Information: Access extensive details about each property to make informed decisions.{br}Responsive Design: The site is fully responsive, ensuring an optimized user experience across all device sizes.{br}{br}Design and Development:{br}Design: The layout and design were crafted by a designer using Figma.{br}Development: Translated the design into a functional website using HTML, CSS, Tailwind CSS, and Vanilla JavaScript.",
    "limooDescription": "Limoo is a comprehensive e-commerce platform designed to facilitate the sale of a wide variety of products. This large-scale online store features numerous pages and sections, all meticulously designed by the company’s creative team.{br}{br}Key Contributions Over One Year:{br}- Feature Expansion: Added new pages, sections, and features to enhance the platform’s functionality and user experience.{br}- Refactoring & Optimization: Undertook a complete refactor and optimization of the project, developing foundational, reusable components to improve maintainability.{br}- Responsive Design: Ensured that various sections of the platform are fully responsive and optimized for different device sizes.{br}{br}Technologies Used:{br}The project was built using HTML, Pure CSS, SCSS, and Nuxt.js, along with related tools.{br}{br}Note: This project was developed for Pars Data but, due to various internal reasons, it was not launched online.",
    "saadatholdingDescription": "Saadat Holding is a comprehensive website developed to showcase the company and facilitate the ordering and sale of its products. The platform includes a wide range of pages, each designed to ensure a good user experience.{br}{br}Key Features:{br}- User Authentication: Includes fully functional login and registration pages.{br}- Product Pages: Features a main homepage, product listings with filtering options, and detailed product pages.{br}- Shopping Experience: Integrated shopping cart functionality for easy purchasing.{br}- Corporate Information: Dedicated pages such as About Us, Contact Us, FAQs, and more to provide detailed company information.{br}- Customer Dashboard: Includes sections for managing customer accounts and access to the loyalty club."
  },
  "contactMe": {
    "contacts": "contacts",
    "findMeAlsoIn": "find-me-also-in",
    "enterYourName": "Enter your name",
    "enterYourEmail": "Enter your email",
    "enterYourMessage": "Enter your message",
    "invalidEmail": "Please enter a valid email!",
    "emailSuccess": "Your email has been successfully sent to me.",
    "emailError": "There is a problem in sending email!",
    "completeFormWarning": "Please complete the form!",
    "pageTitle": "_contact-me"
  }
}
